brew "tree"
brew "bash"
brew "fish"
brew "htop"
brew "make"
brew "neofetch"
brew "neovim"
brew "ninja"
brew "nushell"
brew "starship"
brew "tmux"
brew "tree-sitter-cli"
brew "wget"
brew "zlib"
brew "zsh"
cask "font-hack-nerd-font"
